app/controllers/investments_controller.rb

  def index
    @investments = current_user.investments.all
---
SELECT "investments".* FROM "investments" WHERE "investments"."user_id" = $1  [["user_id", "1"]]

  def create
    @investment = current_user.investments.build(investment_params)

    respond_to do |format|
      if @investment.save
---
INSERT INTO "investments" ("currency_id", "price", "coins", "date", "market_id", "created_at", "updated_at", "user_id", "cryptocurrency_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_investment
      @investment = current_user.investments.find(params[:id])
---
SELECT  "investments".* FROM "investments" WHERE "investments"."user_id" = $1 AND "investments"."id" = $2 LIMIT $3  [["user_id", "1"], ["id", 1], ["LIMIT", 1]]